In [1]:
import pandas as pd
import numpy as np

In [2]:
a = pd.DataFrame(np.arange(12).reshape(3,4))

In [3]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [4]:
#指定行列索引
#行索引，表明不同行，横向索引，叫index，0轴，axis=0
#列索引，表名不同列，纵向索引，叫columns，1轴，axis=1
b = pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("WXYZ"))

In [5]:
b

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [6]:
#字典创建Dataframe方法一
d1 = {"name":["ztfl","xyql","scsyl"],"age":[20,26,26],"tel":[10086,138830,139839]}

In [7]:
t1 = pd.DataFrame(d1)

In [8]:
t1

    name  age     tel
0   ztfl   20   10086
1   xyql   26  138830
2  scsyl   26  139839

In [9]:
#字典创建Dataframe方法二
d2 = [{"name":"ztfl","age":20,"tel":10086},{"name":"xyql","age":26},{"name":"scsyl","tel":139839}]

In [10]:
t2 = pd.DataFrame(d2)

In [11]:
t2

    age   name       tel
0  20.0   ztfl   10086.0
1  26.0   xyql       NaN
2   NaN  scsyl  139839.0

In [12]:
#增加一列
t2['email'] = pd.Series(['123','321','456'])
t2['sex'] = pd.Series(['男','女'],index=[0,1])

In [13]:
t2

    age   name       tel email  sex
0  20.0   ztfl   10086.0   123    男
1  26.0   xyql       NaN   321    女
2   NaN  scsyl  139839.0   456  NaN

In [14]:
#删除一列
del t2['email']

In [15]:
t2

    age   name       tel  sex
0  20.0   ztfl   10086.0    男
1  26.0   xyql       NaN    女
2   NaN  scsyl  139839.0  NaN

In [16]:
t2.pop('sex')

0      男
1      女
2    NaN
Name: sex, dtype: object

In [17]:
t2

    age   name       tel
0  20.0   ztfl   10086.0
1  26.0   xyql       NaN
2   NaN  scsyl  139839.0